# SetFlags Method (Int32, Int32)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ValueAtPointBase..::..SetFlags Method (Int32, Int32)
ValueAtPointBase Class See Also
---
Sets the flags associated to a given measurement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetFlags(
	int flags,
	int measurement
)
```

Visual Basic
---
```text
Public Sub SetFlags ( _
	flags As Integer, _
	measurement As Integer _
)
```

Visual C++
---
```text
public:
void SetFlags(
	int flags,
	int measurement
)
```

# ### Parameters
flags
    Type: System..::..Int32 The value of the flags to set. Flags values are defined in the enumerated class ValueAtPointFlags and are combined into the int value.
measurement
    Type: System..::..Int32 Measurement for which to set flags.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The given value for measurement is negative. |

# See Also
ValueAtPointBase Class
SetFlags Overload
Autodesk.Revit.DB Namespace